In [1]:
#Import dependencies
from sqlalchemy import create_engine, inspect
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#import password
from config import password

#Import SQLAlchemy Automap, ORM from class
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session

In [2]:
#create engine
engine = create_engine(f'postgresql://postgres:{password}@localhost:5432/employee_db')
connection = engine.connect()

In [3]:
inspector = inspect(engine)
inspector.get_table_names()

['departments', 'employees', 'titles', 'dept_emp', 'dept_manager', 'salaries']

In [4]:
#database into ORM class
Base = automap_base()
Base.prepare(engine, reflect = True)
Base.classes.keys()

['departments', 'employees']

In [6]:
# Assign the "Departments" class to a variable called Departments
Departments = Base.classes.departments

# Assign the "Employees" class to a variable called Employees
Employees = Base.classes.employees

# Assign the "Salaries" class to a variable called Salaries
#Salaries = Base.classes.salaries

# Assign the "Titles" class to a variable calledTitlesEmployees
#Titles = Base.classes.titles

In [7]:
#start session to query the database
session = Session(bind=engine)

In [9]:
#query the employees database
query = session.query(Employees)
employee_df = pd.read_sql_query(query.statement, session.get_bind())
employee_df.head()

   emp_no emp_title_id  birth_date  first_name  last_name gender   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco      M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande      F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb      F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff      M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann      F  1991-01-18

In [12]:
#query the employees database for departments
query = session.query(Departments)
department_df = pd.read_sql_query(query.statement, session.get_bind())
department_df.head()

  dept_no        dept_name
0    d001        Marketing
1    d002          Finance
2    d003  Human Resources
3    d004       Production
4    d005      Development

In [22]:
salaries = pd.read_sql("SELECT * FROM salaries", connection)
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [23]:
employees = pd.read_sql("SELECT * FROM employees", connection)
employees.head()

   emp_no emp_title_id  birth_date  first_name  last_name gender   hire_date
0  473302        s0001  1953-07-25    Hideyuki   Zallocco      M  1990-04-28
1  475053        e0002  1954-11-18       Byong  Delgrande      F  1991-09-07
2   57444        e0002  1958-01-30       Berry       Babb      F  1992-03-21
3  421786        s0001  1957-09-28       Xiong   Verhoeff      M  1987-11-26
4  282238        e0003  1952-10-28  Abdelkader    Baumann      F  1991-01-18

In [5]:
employees_salaries = pd.merge(salaries, employees, on="emp_no", how="left")
employees_salaries.head()

,emp_no,salary,emp_title_id,birth_date,first_name,last_name,gender,hire_date
0,10001,60117,e0003,1953-09-02,Georgi,Facello,M,1986-06-26
1,10002,65828,s0001,1964-06-02,Bezalel,Simmel,F,1985-11-21
2,10003,40006,e0003,1959-12-03,Parto,Bamford,M,1986-08-28
3,10004,40054,e0003,1954-05-01,Chirstian,Koblick,M,1986-12-01
4,10005,78228,s0001,1955-01-21,Kyoichi,Maliniak,M,1989-09-12

In [ ]:
x_axis = employees_salaries["salary"]
ticks = np.arange(len(x_axis))
y_axis = employees_salaries["emp_no"]
 
plt.hist(x_axis, y_axis, bins=50, normed=True, alpha=1.0, histtype='stepfilled', color='steelblue', edgecolor='none')

plt.xticks(ticks, x_axis, rotation="vertical")

plt.ylabel("Number of Employees")
plt.xlabel("Salary Range ($)")
plt.title("Total Number of Employees per Salary Range")

plt.savefig("../images/Total Number of Employees per Salary Range.png")

plt.show()

In [1]:
!which python

/c/Users/j1-ag/anaconda3/python